================================================================================
Fancy indirob interpolation
================================================================================
"${\$obj->method}";
"@{[1,2,3]}";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar
        (block
          (expression_statement
            (refgen_expression
              (method_call_expression
                (scalar)
                (method))))))
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (array
        (block
          (expression_statement
            (anonymous_array_expression
              (list_expression
                (number)
                (number)
                (number))))))
      (quotelike_end))))

================================================================================
Array element interpolation
================================================================================
"an array $elem[0]";
"an array $elem->[1] deref";
"an deep $elem->[1][0] deref";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (array_element_expression
        (container_variable)
        (number))
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (array_element_expression
        (scalar)
        (number))
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (array_element_expression
        (array_element_expression
          (scalar)
          (number))
        (number))
      (quotelike_end))))

================================================================================
Hash element interpolation
================================================================================
"a $hash{key}";
"an $hash->{key} deref";
"an deep $hash->{key}{deref}";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (hash_element_expression
        (container_variable)
        (autoquoted_bareword))
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (hash_element_expression
        (scalar)
        (autoquoted_bareword))
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (hash_element_expression
        (hash_element_expression
          (scalar)
          (autoquoted_bareword))
        (autoquoted_bareword))
      (quotelike_end))))

================================================================================
Space skips interpolation
================================================================================
"an array $elem [0]";
"an array $elem ->[1] deref";
"an array $elem-> [1] deref";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar)
      (quotelike_end))))

================================================================================
Slice interpolation
================================================================================
"a plain @ary[0,1]";
"a hash slice @hash{key}";
"and now postfix $aryref->@[0,1,2]";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (slice_expression
        array: (slice_container_variable)
        (list_expression
          (number)
          (number)))
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (slice_expression
        hash: (slice_container_variable)
        (bareword))
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (slice_expression
        arrayref: (scalar)
        (list_expression
          (number)
          (number)
          (number)))
      (quotelike_end))))

================================================================================
Punctuation vars that interpolate
================================================================================
"$+";
"$(";
"$!";
"@+";
"@-";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (array)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (array)
      (quotelike_end))))

================================================================================
Punctuation vars that do not interpolate
================================================================================
"@(";
"@)";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (quotelike_end))))
