================================================================================
integers
================================================================================
123;
077;
0xDEADBEEF;
0b11011011011;
1234567890198;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (number))
  (expression_statement
    (number))
  (expression_statement
    (number))
  (expression_statement
    (number))
  (expression_statement
    (number)))

================================================================================
floats
================================================================================
111_111e99_99;
111_111e-99_99;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (number))
  (expression_statement
    (number)))

================================================================================
'' strings
================================================================================
'hello';
'a\'string';
'a\\string';
'\n is literal';
'a string with a final \\';
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (string_literal
      (quotelike_begin)
      (escaped_delimiter)
      (quotelike_end)))
  (expression_statement
    (string_literal
      (quotelike_begin)
      (escape_sequence)
      (quotelike_end)))
  (expression_statement
    (string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (string_literal
      (quotelike_begin)
      (escape_sequence)
      (quotelike_end))))

================================================================================
q() strings
================================================================================
q(hello);
q(a 'string');
q(a (string) here);
q"literal $without interpolation";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (string_literal
      (quotelike_begin)
      (quotelike_end))))

================================================================================
"" strings
================================================================================
"hello";
"a\"string";
"a\\string";
"a string w/ a final \\";
"a string with\nlinefeed";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (escaped_delimiter)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (escape_sequence)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (escape_sequence)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (escape_sequence)
      (quotelike_end))))

================================================================================
"" strings - no runaway barewords (fix when ambiguous funcs hit)
================================================================================
BAREWORD"string"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (ambiguous_function_call_expression
      (function)
      (interpolated_string_literal
        (quotelike_begin)
        (quotelike_end)))))

================================================================================
qq() strings
================================================================================
qq(hello);
qq(a 'string');
qq(a (string) here);
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (quotelike_end))))

================================================================================
quotelike strings - tricky delimeters
================================================================================
q#hello#;
q # this is a comment
   (hello);
# another comment so this can fail properly
q\backslashes\;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (string_literal
      (comment)
      (quotelike_begin)
      (quotelike_end)))
  (comment)
  (expression_statement
    (string_literal
      (quotelike_begin)
      (quotelike_end))))

================================================================================
Interpolation in "" strings
================================================================================
"with $scalar";
"but not with a $ space after";
"with @array";
qq'with $scalar in single-quotes';
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (array)
      (quotelike_end)))
  (expression_statement
    (interpolated_string_literal
      (quotelike_begin)
      (scalar)
      (quotelike_end))))

================================================================================
qw() lists
================================================================================
qw( a b c );
qw();
qw/ 1 2 /;
qw/ literal\nslash-n /;
qw/ literal \n slash-n /;
qw| double escape \\|;
qw/ hello \/ goodbye /;
qw\ backslashes \;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (quoted_word_list
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (quoted_word_list
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (quoted_word_list
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (quoted_word_list
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (quoted_word_list
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (quoted_word_list
      (quotelike_begin)
      (escape_sequence)
      (quotelike_end)))
  (expression_statement
    (quoted_word_list
      (quotelike_begin)
      (escaped_delimiter)
      (quotelike_end)))
  (expression_statement
    (quoted_word_list
      (quotelike_begin)
      (quotelike_end))))

================================================================================
`` strings
================================================================================
`command`;
`command with (parens)`;
`command with $interpolation`;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (command_string
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (command_string
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (command_string
      (quotelike_begin)
      (scalar)
      (quotelike_end))))

================================================================================
qx() strings
================================================================================
qx(command);
qx(command with (parens));
qx(command with $interpolation);
qx'command with no $interpolation';
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (command_string
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (command_string
      (quotelike_begin)
      (quotelike_end)))
  (expression_statement
    (command_string
      (quotelike_begin)
      (scalar)
      (quotelike_end)))
  (expression_statement
    (command_string
      (quotelike_begin)
      (quotelike_end))))
